In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male','Female','Female']}

In [3]:
df = pd.DataFrame(dict1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [6]:
# Display top 3 rows of data set

df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [7]:
# check last 3 rows of the dataset

df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
# shape of the dataset

print("Number of rows:",df.shape[0])
print("Number of columns:",df.shape[1])

Number of rows: 7
Number of columns: 3

In [9]:
# information of the dataset

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [10]:
# Null values

df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [12]:
# null values rowwise

df.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [11]:
# overall statistics of the dataset

df.describe().T

       count       mean       std   min   25%   50%   75%   max
Marks    7.0  92.142857  6.491753  83.0  88.0  90.0  98.5  99.0

In [14]:
# unique values of dataframe

df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [15]:
# number of unique values in the gender column

df['Gender'].nunique()

2

In [16]:
# count of unique values

df['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

### find number of students having marks between 90 to 100(inclusive) using between method

In [17]:
df[df['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [19]:
df[(df['Marks']>=90) &  (df['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [20]:
len(df[(df['Marks']>=90) &  (df['Marks']<=100)])

4

In [22]:
# in between method both are inclusive

sum(df['Marks'].between(90, 100))

4

### Find Avearge marks

In [23]:
df['Marks'].mean()

92.14285714285714

In [24]:
df['Marks'].min()

83

In [25]:
df['Marks'].max()

99

### Apply method

In [26]:
def marks(x):
    return x/2

In [27]:
df['Half_marks'] = df['Marks'].apply(marks)

In [28]:
df.head(4)

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5

In [29]:
df['Marks'].apply(lambda x: x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [30]:
df['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

### Map function

In [32]:
df['Male_Female'] = df['Gender'].map({'Male':1, 'Female':0})

In [33]:
df.head()

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1

### Drop the columns

In [34]:
df.drop('Male_Female', axis=1)

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [35]:
df.drop(['Male_Female', 'Half_marks'], axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [36]:
df.head()

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1

In [37]:
df.drop(['Male_Female', 'Half_marks'], axis=1,inplace=True)

In [38]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [40]:
# index of the dataframe

df.index

RangeIndex(start=0, stop=7, step=1)

### sort the dataframe as per the marks column

In [42]:
# to check the doc string of data frame shift+tab

df.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

### display name and marks of the female students

In [4]:
df['Gender']=='Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [5]:
df[df['Gender']=='Female']

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [6]:
df[df['Gender']=='Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [8]:
# by using isin method

df[df['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99